# CSV FILE WAS IMPORTED USING READ_CSV() METHOD AND ASSIGNED TO A VARIABLE

In [1]:
import numpy as np
import pandas as pd

In [2]:
flights = pd.read_csv('/Users/dukephung/Desktop/Spring2019/IS 362/Project1_flights.csv',
                     usecols=[1, 2, 3, 4, 5, 6])

### DATA WAS SUMMED ACROSS THE ROW TO TOTAL ON TIME AND DELAYED TIME

In [3]:
flights['Total'] = flights.sum(axis=1)
flights

    Status  Los Angeles  Phoenix  San Diego  San Francisco  Seattle   Total
0  on time        497.0    221.0      212.0          503.0   1841.0  3274.0
1  delayed         62.0     12.0       20.0          102.0    305.0   501.0
2      NaN          NaN      NaN        NaN            NaN      NaN     0.0
3  on time        694.0   4840.0      383.0          320.0    201.0  6438.0
4  delayed        117.0    415.0       65.0           29.0     61.0   687.0

### ALASKA AIRLINES DATA ASSIGNED TO alaska VARIABLE USING .copy() TO RETAIN ORIGINAL INFORMATION

In [5]:
alaska = flights[:2].copy().set_index('Status')
alaska

         Los Angeles  Phoenix  San Diego  San Francisco  Seattle   Total
Status
on time        497.0    221.0      212.0          503.0   1841.0  3274.0
delayed         62.0     12.0       20.0          102.0    305.0   501.0

### AM WEST DATA ASSIGNED TO am_west VARIABLE USING .copy() TO RETAIN ORIGINAL DATA

In [6]:
am_west = flights[3:5].copy().set_index('Status')
am_west

         Los Angeles  Phoenix  San Diego  San Francisco  Seattle   Total
Status
on time        694.0   4840.0      383.0          320.0    201.0  6438.0
delayed        117.0    415.0       65.0           29.0     61.0   687.0

### CALCULATE ON TIME PERCENTAGE

In [7]:
alaska_eff = (alaska.at['on time', 'Total']/(alaska.at['on time', 'Total'] + 
                                             alaska.at['delayed', 'Total']) * 100)
alaska_eff

86.72847682119206

In [8]:
am_west_eff = (am_west.at['on time', 'Total']/(am_west.at['on time', 'Total'] + 
                                             am_west.at['delayed', 'Total']) * 100)
am_west_eff

90.3578947368421

In [9]:
if alaska_eff > am_west_eff:
    print('Alaska flights were more dependable with {:.2f} percentage on time'.format(alaska_eff))
else:
    print('Am West are more efficient with {:.2f} percent on time'.format(am_west_eff))

Am West are more efficient with 90.36 percent on time

### Restructure both airline data into new DataFrame with airline name as key and status as index

In [10]:
newflights = pd.concat([alaska, am_west], keys=['ALASKA', 'AM WEST'])
newflights

                 Los Angeles  Phoenix  San Diego  San Francisco  Seattle  \
        Status
ALASKA  on time        497.0    221.0      212.0          503.0   1841.0
        delayed         62.0     12.0       20.0          102.0    305.0
AM WEST on time        694.0   4840.0      383.0          320.0    201.0
        delayed        117.0    415.0       65.0           29.0     61.0

                  Total
        Status
ALASKA  on time  3274.0
        delayed   501.0
AM WEST on time  6438.0
        delayed   687.0